const snobj = [
  {
    name: [
      'ㅋㅋㄹㅃㅃ',
      'ㅋㅋ루삥뽕',
      '쿠쿠루삥뽕'
    ],
    url: '찬구/ㅋㅋ뤀삥뽕'
  },
  {
    name: [
      '우욱씹',
      '우욱'
    ],
    url: '찬구/우욱'
  },
  {
    name: [
      '멈춰'
    ],
    url: '멈춰'
  },
  {
    name: [
      '나락'
    ],
    url: '나락'
  },
  {
    name: [
      '응아니야',
      '응 아니야'
    ],
    url: '응아니야'
  },
  {
    name: [
      '무야호',
      '무 야호'
    ],
    url: '무야호'
  },
  {
    name: [
      '앙기모찌',
      '앙 기모찌',
      '앙기모띠',
      '앙 기모띠',
    ],
    url: '앙기모찌'
  },
  {
    name: [
      '대박자'
    ],
    url: '대박자'
  },
  {
    name: [
      '누구인가',
      '누구인가?'
    ],
    url: '누구인가'
  },
  {
    name: [
      '자리에않어',
      '자리에 앉어',
      '자리앉아'
    ],
    url: '자리에앉어'
  },
  {
    name: [
      '너는 지금 뭐해, 자니, 밖이야?',
      '너지뭐자밖'
    ],
    url: '너지뭐자밖'
  },
  {
    name: [
      '자드가자',
      '자 드가자'
    ],
    url: '랄로/자드가자'
  },
  {
    name: [
      '마라탕'
    ],
    url: '랄로/마라탕'
  },
  {
    name: [
      '컷',
      '컽'
    ],
    url: '랄로/컷'
  },
  {
    name: [
      '아이고난',
      '아이고 난'
    ],
    url: '케인/아이고난'
  },
  {
    name: [
      '배먹어배',
      '배먹어 배'
    ],
    url: '케인/배먹어배'
  },
  {
    name: [
      '주겨벌랑',
      '죽여벌랑'
    ],
    url: '케인/주겨벌랑'
  },
  {
    name: [
      '겨울배'
    ],
    url: '케인/겨울배'
  },
  {
    name: [
      '어허'
    ],
    url: '브베/어허'
  },
  {
    name: [
      '샤를르클레르',
      '샤를 르클레르'
    ],
    url: 'f1/샤를르클레르'
  },
  {
    name: [
      '버근가',
      'ㅂㄱㄱ',
      '버근가?',
      'ㅂㄱㄱ?'
    ],
    url: '페이커/버근가'
  },
  {
    name: [
      '예민하네',
      '화났네',
      '잉토바이'
    ],
    url: '우정잉/잉토바이'
  },
  {
    name: [
      '돌리',
      '도트'
    ],
    url: '돌리랑도트'
  },
  {
    name: [
      '자꾸',
      '짜꾸'
    ],
    url: '똘삼/자꾸'
  },
  {
    name: [
      '카무이',
      '라이즈'
    ],
    url: '파카/카무이'
  },
  {
    name: [
      '네가 최고야',
      '니가 최고야'
    ],
    url: '파카/네가 최고야'
  },
  {
    name: [
      '캐리',
      '캐리!'
    ],
    url: '파카/캐리'
  },
  {
    name: [
      '후잉'
    ],
    url: '파카/후잉'
  },
  {
    name: [
      '훈수'
    ],
    url: '우왁굳/훈수'
  },
  {
    name: [
      '테헹'
    ],
    url: '우왁굳/테헹'
  },
  {
    name: [
      '씹찐따'
    ],
    url: '우왁굳/씹찐따'
  },
  {
    name: [
      '구구',
      '99'
    ],
    url: '구구비둘기'
  },
  {
    name: [
      '비둘기야 먹자'
    ],
    url: '말기쪙'
  },
  {
    name: [
      '뭐가 살쪄',
      '뭐가살쪄'
    ],
    url: '뭐가살쪄'
  }
];

let sncheckobj = {};
for (let i in snobj) {
  let obj = snobj[i];
  for (let j in obj.name) {
    eval(`sncheckobj['${obj.name[j]}'] = '${obj.url}'`);
  }
}

export const signature_check_obj = sncheckobj;
export const signature_obj = snobj;